// Необходимо написать программу, которая принемает число на вход и показывает его квадрат

Console.Clear();
Console.Write("Введите число: ");
int n = int.Parse(Console.ReadLine()!);
Console.WriteLine(n * n);